Berketunc/SearchNRescue/ESP32_CAM_FaceDetect/app_httpd.cpp
// Copyright 2015-2016 Espressif Systems (Shanghai) PTE LTD
//
// Licensed under the Apache License, Version 2.0 (the "License");
// you may not use this file except in compliance with the License.
// You may obtain a copy of the License at
//
//     http://www.apache.org/licenses/LICENSE-2.0
//
// Unless required by applicable law or agreed to in writing, software
// distributed under the License is distributed on an "AS IS" BASIS,
// WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
// See the License for the specific language governing permissions and
// limitations under the License.
#include "esp_http_server.h"
#include "esp_timer.h"
#include "esp_camera.h"
#include "img_converters.h"
#include "fb_gfx.h"
#include "esp32-hal-ledc.h"
#include "sdkconfig.h"
#include "camera_index.h"
#include "board_config.h"

#if defined(__has_include)
#if __has_include("human_face_detect_msr01.hpp") && __has_include("human_face_detect_mnp01.hpp")
#include <list>
#include <vector>
#include "human_face_detect_msr01.hpp"
#include "human_face_detect_mnp01.hpp"
#define FACE_DETECT_BACKEND_NEW 1
#define FACE_DETECT_BACKEND_OLD 0
#elif __has_include("fd_forward.h") && __has_include("dl_lib.h")
#include "fd_forward.h"
#include "dl_lib.h"
#define FACE_DETECT_BACKEND_NEW 0
#define FACE_DETECT_BACKEND_OLD 1
#else
#define FACE_DETECT_BACKEND_NEW 0
#define FACE_DETECT_BACKEND_OLD 0
#endif
#else
#define FACE_DETECT_BACKEND_NEW 0
#define FACE_DETECT_BACKEND_OLD 0
#endif

#if FACE_DETECT_BACKEND_NEW || FACE_DETECT_BACKEND_OLD
#define FACE_DETECT_AVAILABLE 1
#else
#define FACE_DETECT_AVAILABLE 0
#endif

#if defined(ARDUINO_ARCH_ESP32) && defined(CONFIG_ARDUHAL_ESP_LOG)
#include "esp32-hal-log.h"
#endif

// LED FLASH setup
#if defined(LED_GPIO_NUM)
#define CONFIG_LED_MAX_INTENSITY 255
#define LED_LEDC_CHANNEL 4
#define LED_LEDC_FREQ_HZ 5000
#define LED_LEDC_RES_BITS 8

int led_duty = 0;
bool isStreaming = false;

#endif

typedef struct {
  httpd_req_t *req;
  size_t len;
} jpg_chunking_t;

#define PART_BOUNDARY "123456789000000000000987654321"
static const char *_STREAM_CONTENT_TYPE = "multipart/x-mixed-replace;boundary=" PART_BOUNDARY;
static const char *_STREAM_BOUNDARY = "\r\n--" PART_BOUNDARY "\r\n";
static const char *_STREAM_PART = "Content-Type: image/jpeg\r\nContent-Length: %u\r\nX-Timestamp: %d.%06d\r\n\r\n";

httpd_handle_t stream_httpd = NULL;
httpd_handle_t camera_httpd = NULL;

static volatile int g_face_detect_enabled = 1;
static volatile int g_face_recognize_enabled = 0;
static volatile int g_last_human_present = 0;
static volatile int g_last_face_count = 0;
static volatile int64_t g_last_detection_ms = 0;

static const char HUMAN_STATUS_PAGE[] = R"HTML(
<!doctype html>
<html lang="en">
<head>
  <meta charset="utf-8" />
  <meta name="viewport" content="width=device-width,initial-scale=1" />
  <title>ESP32-CAM Human Presence</title>
  <style>
    :root {
      --bg1: #f8f4e8;
      --bg2: #dde9f4;
      --card: rgba(255, 255, 255, 0.86);
      --ink: #1f2937;
      --ok: #1f7a3e;
      --warn: #c2410c;
      --muted: #475569;
    }
    body {
      margin: 0;
      min-height: 100vh;
      font-family: "Trebuchet MS", "Segoe UI", sans-serif;
      background: radial-gradient(circle at 20% 20%, var(--bg2), transparent 45%),
                  radial-gradient(circle at 80% 75%, #ffd8a8, transparent 45%),
                  var(--bg1);
      color: var(--ink);
      display: grid;
      place-items: center;
      padding: 16px;
    }
    .card {
      width: min(560px, 100%);
      background: var(--card);
      border-radius: 18px;
      padding: 22px;
      box-shadow: 0 16px 40px rgba(20, 34, 48, 0.15);
      backdrop-filter: blur(4px);
    }
    h1 {
      margin: 0 0 8px;
      font-size: clamp(24px, 3.2vw, 34px);
    }
    .sub {
      margin: 0 0 20px;
      color: var(--muted);
    }
    .pill {
      font-size: clamp(24px, 5vw, 42px);
      font-weight: 700;
      line-height: 1.1;
      border-radius: 12px;
      padding: 14px 16px;
      margin: 10px 0 14px;
      border: 2px solid transparent;
      transition: transform .16s ease, background-color .16s ease;
    }
    .present {
      color: var(--ok);
      background: #dcfce7;
      border-color: #86efac;
      transform: translateY(-1px);
    }
    .absent {
      color: var(--warn);
      background: #ffedd5;
      border-color: #fdba74;
    }
    .meta {
      color: var(--muted);
      display: grid;
      gap: 6px;
      font-size: 15px;
    }
    .actions {
      margin-top: 14px;
      display: flex;
      gap: 10px;
      flex-wrap: wrap;
    }
    .btn {
      border: 0;
      border-radius: 10px;
      padding: 10px 14px;
      font-weight: 700;
      cursor: pointer;
      background: #0f766e;
      color: #f8fafc;
    }
    .btn:disabled {
      opacity: 0.6;
      cursor: wait;
    }
    .err {
      margin-top: 12px;
      color: #991b1b;
      min-height: 20px;
      font-size: 14px;
    }
  </style>
</head>
<body>
  <main class="card">
    <h1>Human Presence Monitor</h1>
    <p class="sub">ESP32-CAM AP Live Face Detection</p>
    <div id="presence" class="pill absent">Checking...</div>
    <div class="meta">
      <div>Faces: <strong id="count">0</strong></div>
      <div>Detection enabled: <strong id="enabled">unknown</strong></div>
      <div>Last update: <strong id="ts">-</strong></div>
    </div>
    <div class="actions">
      <button id="toggleDetection" class="btn" type="button">Enable Face Detection</button>
    </div>
    <div id="err" class="err"></div>
  </main>
  <script>
    const presenceEl = document.getElementById('presence');
    const countEl = document.getElementById('count');
    const enabledEl = document.getElementById('enabled');
    const tsEl = document.getElementById('ts');
    const errEl = document.getElementById('err');
    const toggleBtn = document.getElementById('toggleDetection');

    let detectionEnabled = false;

    function refreshButton() {
      toggleBtn.textContent = detectionEnabled ? 'Disable Face Detection' : 'Enable Face Detection';
    }

    async function setDetection(enabled) {
      toggleBtn.disabled = true;
      try {
        const r = await fetch('/control?var=face_detect&val=' + (enabled ? '1' : '0'));
        if (!r.ok) {
          throw new Error('HTTP ' + r.status);
        }
        detectionEnabled = enabled;
        refreshButton();
      } catch (e) {
        errEl.textContent = 'Toggle failed: ' + e.message;
      } finally {
        toggleBtn.disabled = false;
      }
    }

