Berketunc/SearchNRescue/ESP32_CAM_FaceDetect/app_httpd.cpp
    toggleBtn.addEventListener('click', () => setDetection(!detectionEnabled));

    async function poll() {
      try {
        const r = await fetch('/human_status?_=' + Date.now(), { cache: 'no-store' });
        if (!r.ok) {
          throw new Error('HTTP ' + r.status);
        }
        const data = await r.json();
        const present = !!data.human_present;
        presenceEl.textContent = present ? 'Human Present' : 'No Human Detected';
        presenceEl.className = 'pill ' + (present ? 'present' : 'absent');
        countEl.textContent = data.face_count ?? 0;
        detectionEnabled = !!data.face_detect_enabled;
        enabledEl.textContent = detectionEnabled ? 'yes' : 'no';
        refreshButton();
        tsEl.textContent = new Date().toLocaleTimeString();
        errEl.textContent = data.error || '';
      } catch (e) {
        errEl.textContent = 'Status fetch failed: ' + e.message;
      }
    }

    poll();
    setInterval(poll, 1000);
  </script>
</body>
</html>
)HTML";

typedef struct {
  size_t size;   //number of values used for filtering
  size_t index;  //current value index
  size_t count;  //value count
  int sum;
  int *values;  //array to be filled with values
} ra_filter_t;

static ra_filter_t ra_filter;

#if FACE_DETECT_BACKEND_OLD
static mtmn_config_t g_mtmn_config = mtmn_init_config();
#endif

#if FACE_DETECT_BACKEND_NEW
#define FACE_DETECT_TWO_STAGE 1
static HumanFaceDetectMSR01 g_face_msr(0.1F, 0.5F, 10, 0.2F);
#if FACE_DETECT_TWO_STAGE
static HumanFaceDetectMNP01 g_face_mnp(0.5F, 0.3F, 5);
#endif
#endif

typedef struct {
  bool present;
  int face_count;
  bool ok;
  const char *error;
} face_detection_result_t;

static face_detection_result_t detect_human_face_once() {
  face_detection_result_t result = {false, 0, false, "unknown"};

#if !FACE_DETECT_AVAILABLE
  result.error = "Face detection library unavailable in this ESP32 core.";
  return result;
#elif FACE_DETECT_BACKEND_NEW
  camera_fb_t *fb = esp_camera_fb_get();
  if (!fb) {
    result.error = "Camera capture failed";
    return result;
  }

  if (fb->format == PIXFORMAT_RGB565) {
#if FACE_DETECT_TWO_STAGE
    std::list<dl::detect::result_t> &candidates = g_face_msr.infer((uint16_t *)fb->buf, {(int)fb->height, (int)fb->width, 3});
    std::list<dl::detect::result_t> &results = g_face_mnp.infer((uint16_t *)fb->buf, {(int)fb->height, (int)fb->width, 3}, candidates);
#else
    std::list<dl::detect::result_t> &results = g_face_msr.infer((uint16_t *)fb->buf, {(int)fb->height, (int)fb->width, 3});
#endif
    result.face_count = (int)results.size();
    result.present = result.face_count > 0;
    result.ok = true;
    result.error = "";
    esp_camera_fb_return(fb);
    return result;
  }

  int frame_w = (int)fb->width;
  int frame_h = (int)fb->height;
  size_t out_len = (size_t)frame_w * (size_t)frame_h * 3;
  uint8_t *out_buf = (uint8_t *)malloc(out_len);
  if (!out_buf) {
    esp_camera_fb_return(fb);
    result.error = "RGB buffer allocation failed";
    return result;
  }

  bool converted = fmt2rgb888(fb->buf, fb->len, fb->format, out_buf);
  esp_camera_fb_return(fb);
  if (!converted) {
    free(out_buf);
    result.error = "Frame RGB conversion failed";
    return result;
  }

#if FACE_DETECT_TWO_STAGE
  std::list<dl::detect::result_t> &candidates = g_face_msr.infer((uint8_t *)out_buf, {frame_h, frame_w, 3});
  std::list<dl::detect::result_t> &results = g_face_mnp.infer((uint8_t *)out_buf, {frame_h, frame_w, 3}, candidates);
#else
  std::list<dl::detect::result_t> &results = g_face_msr.infer((uint8_t *)out_buf, {frame_h, frame_w, 3});
#endif

  result.face_count = (int)results.size();
  result.present = result.face_count > 0;
  result.ok = true;
  result.error = "";
  free(out_buf);
  return result;
#else
  camera_fb_t *fb = esp_camera_fb_get();
  if (!fb) {
    result.error = "Camera capture failed";
    return result;
  }

  dl_matrix3du_t *image_matrix = dl_matrix3du_alloc(1, fb->width, fb->height, 3);
  if (!image_matrix) {
    esp_camera_fb_return(fb);
    result.error = "RGB buffer allocation failed";
    return result;
  }

  bool converted = fmt2rgb888(fb->buf, fb->len, fb->format, image_matrix->item);
  esp_camera_fb_return(fb);
  if (!converted) {
    dl_matrix3du_free(image_matrix);
    result.error = "Frame RGB conversion failed";
    return result;
  }

  box_array_t *net_boxes = face_detect(image_matrix, &g_mtmn_config);
  if (net_boxes) {
    result.face_count = net_boxes->len;
    result.present = net_boxes->len > 0;
    if (net_boxes->score) {
      free(net_boxes->score);
    }
    if (net_boxes->box) {
      free(net_boxes->box);
    }
    if (net_boxes->landmark) {
      free(net_boxes->landmark);
    }
    free(net_boxes);
  }

  dl_matrix3du_free(image_matrix);
  result.ok = true;
  result.error = "";
  return result;
#endif
}

static esp_err_t human_status_handler(httpd_req_t *req) {
  char json_response[320];

  face_detection_result_t detection = {false, 0, false, "face detection disabled"};
  if (g_face_detect_enabled) {
    detection = detect_human_face_once();
    if (detection.ok) {
      g_last_human_present = detection.present ? 1 : 0;
      g_last_face_count = detection.face_count;
      g_last_detection_ms = esp_timer_get_time() / 1000;
    }
  }

  snprintf(
    json_response,
    sizeof(json_response),
    "{\"face_detect_enabled\":%s,\"face_recognize_enabled\":%s,\"human_present\":%s,\"face_count\":%d,\"last_detection_ms\":%lld,\"ok\":%s,\"error\":\"%s\"}",
    g_face_detect_enabled ? "true" : "false", g_face_recognize_enabled ? "true" : "false",
    (detection.ok ? detection.present : (g_last_human_present != 0)) ? "true" : "false", detection.ok ? detection.face_count : g_last_face_count,
    (long long)g_last_detection_ms, detection.ok ? "true" : "false", detection.error ? detection.error : ""
  );

  httpd_resp_set_type(req, "application/json");
  httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
  return httpd_resp_send(req, json_response, strlen(json_response));
}

static esp_err_t human_page_handler(httpd_req_t *req) {
  httpd_resp_set_type(req, "text/html");
  httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
  return httpd_resp_send(req, HUMAN_STATUS_PAGE, strlen(HUMAN_STATUS_PAGE));
}

static ra_filter_t *ra_filter_init(ra_filter_t *filter, size_t sample_size) {
  memset(filter, 0, sizeof(ra_filter_t));

